In [1]:
import numpy as np
import pandas as pd
from sklearn.svm import SVC
from sklearn.pipeline import Pipeline

In [2]:
df=pd.read_csv("Documents/M2IMSD-Nouveaux fichiers/M2IMSD/Data/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
total=df.isnull()
total

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [5]:
total=df.isnull().sum().sort_values(ascending=False)
total

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

In [ ]:
#We remove "Cabine" besause it has 77 % of missing values

In [6]:
colonnes=['PassengerId','Ticket','Name', 'Cabin']
df=df.drop(colonnes, axis=1)
df

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [7]:
#making Embarked and Sex numerical

In [8]:
sex_df=pd.get_dummies(df['Sex'], prefix='sex')

In [9]:
embarked_df=pd.get_dummies(df['Embarked'], prefix='embarked', dummy_na=True)

In [10]:
titanic_df=pd.concat([df, embarked_df, sex_df], axis=1)

In [11]:
titanic_df

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,embarked_C,embarked_Q,embarked_S,embarked_nan,sex_female,sex_male
0,0,3,male,22.0,1,0,7.2500,S,0,0,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,C,1,0,0,0,1,0
2,1,3,female,26.0,0,0,7.9250,S,0,0,1,0,1,0
3,1,1,female,35.0,1,0,53.1000,S,0,0,1,0,1,0
4,0,3,male,35.0,0,0,8.0500,S,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,0,0,1,0,0,1
887,1,1,female,19.0,0,0,30.0000,S,0,0,1,0,1,0
888,0,3,female,NaN,1,2,23.4500,S,0,0,1,0,1,0
889,1,1,male,26.0,0,0,30.0000,C,1,0,0,0,0,1
890,0,3,male,32.0,0,0,7.7500,Q,0,1,0,0,0,1

In [12]:
titanic_df.drop(['Sex', 'Embarked'], axis=1, inplace=True)

In [13]:
titanic_df

,Survived,Pclass,Age,SibSp,Parch,Fare,embarked_C,embarked_Q,embarked_S,embarked_nan,sex_female,sex_male
0,0,3,22.0,1,0,7.2500,0,0,1,0,0,1
1,1,1,38.0,1,0,71.2833,1,0,0,0,1,0
2,1,3,26.0,0,0,7.9250,0,0,1,0,1,0
3,1,1,35.0,1,0,53.1000,0,0,1,0,1,0
4,0,3,35.0,0,0,8.0500,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,0,0,1,0,0,1
887,1,1,19.0,0,0,30.0000,0,0,1,0,1,0
888,0,3,NaN,1,2,23.4500,0,0,1,0,1,0
889,1,1,26.0,0,0,30.0000,1,0,0,0,0,1
890,0,3,32.0,0,0,7.7500,0,1,0,0,0,1

In [31]:
titanic_df.drop(['sex_male'], axis=1, inplace=True)

In [36]:
X=titanic_df.drop(['Survived'], axis=1)
y=titanic_df['Survived']

In [15]:
#Imputing missing values

In [16]:
from sklearn.impute import SimpleImputer

In [37]:
col_names=X.columns

In [50]:
titanic_imputer=SimpleImputer(strategy='mean')
titanic_imputer.fit(X)
Ximputed=titanic_imputer.transform(X)

In [ ]:
#normalizing the data

In [51]:
from sklearn import preprocessing

from sklearn.preprocessing import StandardScaler

In [52]:
scaler = StandardScaler()

In [53]:
scaler.fit(Ximputed)

StandardScaler()

In [54]:
Xscaled=scaler.transform(Ximputed)

In [55]:
X=pd.DataFrame(data=Xscaled,columns= col_names)

In [ ]:
# Splitting data into train and test subsets

In [56]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [57]:
#random forest

In [58]:
from sklearn.ensemble import RandomForestClassifier
from sklearn import metrics

In [59]:
random_forest=RandomForestClassifier(n_estimators=50, max_depth=5, random_state=42)

In [60]:
random_forest.fit(X_train, y_train)
pred_y=random_forest.predict(X_test)
print(metrics.classification_report(y_test, pred_y))

              precision    recall  f1-score   support

           0       0.80      0.89      0.84       105
           1       0.81      0.69      0.74        74

    accuracy                           0.80       179
   macro avg       0.81      0.79      0.79       179
weighted avg       0.80      0.80      0.80       179

In [61]:
# Decision tree

In [62]:
from sklearn import tree
from sklearn.tree import DecisionTreeClassifier

In [63]:
tree_classifier = DecisionTreeClassifier(max_depth=3)

In [64]:
tree_classifier.fit(X_train, y_train)
predtree_y=tree_classifier.predict(X_test)
print(metrics.classification_report(y_test, predtree_y))

              precision    recall  f1-score   support

           0       0.80      0.88      0.84       105
           1       0.80      0.69      0.74        74

    accuracy                           0.80       179
   macro avg       0.80      0.78      0.79       179
weighted avg       0.80      0.80      0.80       179

In [ ]:
#better accuracy for random forest compared to one decision tree

In [65]:
random_forest.feature_importances_

array([1.28442455e-01, 1.18050404e-01, 4.08503365e-02, 3.35516092e-02,
       1.62631433e-01, 1.82328064e-02, 6.56156388e-03, 2.33585713e-02,
       5.62941403e-05, 4.68264527e-01])

In [ ]:
#the most important variable is the last one : gender, also Pclass and Fare

In [ ]:
#KNN

In [66]:
from sklearn import neighbors

In [67]:
knn= neighbors.KNeighborsClassifier(n_neighbors=3)

In [69]:
knn.fit(X_train, y_train)
predknn_y=knn.predict(X_test)
print(metrics.classification_report(y_test, predknn_y))

              precision    recall  f1-score   support

           0       0.81      0.84      0.83       105
           1       0.76      0.73      0.74        74

    accuracy                           0.79       179
   macro avg       0.79      0.78      0.79       179
weighted avg       0.79      0.79      0.79       179

In [70]:
from sklearn import metrics

In [ ]:
#logistic regression

In [71]:
from sklearn.linear_model import LogisticRegression

In [73]:
logreg=LogisticRegression()

In [75]:
logreg.fit(X_train, y_train)
predlogreg_y=logreg.predict(X_test)
print(metrics.classification_report(y_test, predlogreg_y))

              precision    recall  f1-score   support

           0       0.83      0.86      0.84       105
           1       0.79      0.74      0.76        74

    accuracy                           0.81       179
   macro avg       0.81      0.80      0.80       179
weighted avg       0.81      0.81      0.81       179

In [76]:
logreg.coef_

array([[-0.79597627, -0.40930755, -0.32867065, -0.09871685,  0.11737359,
         0.08487071,  0.01853474, -0.10313703,  0.16400117,  1.2790136 ]])

In [77]:
logreg.intercept_

array([-0.61730195])

In [ ]:
# the first and the last variables are the most important one in absolute value:
# class and gender
#they are the most important in the computation of the probability of survival.

In [ ]:
#svm

In [78]:
svm=SVC(kernel='rbf')

In [79]:
svm.fit(X_train, y_train)
predsvm_y=svm.predict(X_test)
print(metrics.classification_report(y_test, predsvm_y))

              precision    recall  f1-score   support

           0       0.82      0.89      0.85       105
           1       0.82      0.72      0.76        74

    accuracy                           0.82       179
   macro avg       0.82      0.80      0.81       179
weighted avg       0.82      0.82      0.81       179

In [ ]:
#In terms of accuracy, svm performs a little better than the other algorithms tested on this data set.